package com.kb.itisme.trend.dto;

import java.util.List;

public enum KeywordGroup {
    TRAVEL("여행", List.of("여행", "항공", "호텔", "관광", "국내여행", "해외여행", "관광지", "휴양지", "항공권", "리조트", "여행지", "휴가", "여행사", "레저", "여행코스", "배낭여행", "온천", "캠핑", "하이킹", "트래킹")),
    SHOPPING("쇼핑", List.of("쿠팡", "이마트", "홈플러스", "쇼핑몰", "할인", "세일", "유통", "마켓", "백화점", "소셜커머스", "온라인쇼핑", "면세점", "슈퍼마켓", "트렌드", "패션몰", "종합몰", "편의점", "시장", "소비", "구매")),
    TECHNOLOGY("기술", List.of("삼성전자", "애플", "AI", "갤럭시", "5G", "아이폰", "가상현실", "클라우드", "인공지능", "드론", "자동화", "데이터", "네트워크", "로봇", "디지털", "웨어러블", "자율주행", "소프트웨어", "개발자", "혁신")),
    ECONOMY("경제", List.of("주식", "펀드", "부동산", "투자", "금리", "환율", "물가", "GDP", "소득", "지수", "채권", "물가상승", "금융", "재정", "부채", "국제경제", "기업", "무역", "소비자물가", "통화")),
    SPORTS("스포츠", List.of("축구", "야구", "올림픽", "농구", "배구", "마라톤", "테니스", "수영", "골프", "복싱", "사이클", "양궁", "격투기", "유도", "육상", "체조", "탁구", "크리켓", "필드하키", "스키")),
    MUSIC("음악", List.of("K-pop", "BTS", "콘서트", "아이돌", "음악방송", "앨범", "뮤직비디오", "케이팝", "음반", "클래식", "재즈", "인디", "락", "힙합", "랩", "발라드", "블랙핑크", "라이브", "싱어송라이터", "가수")),
    MOVIES("영화", List.of("넷플릭스", "영화관", "드라마", "할리우드", "액션", "코미디", "로맨스", "스릴러", "SF", "다큐멘터리", "애니메이션", "시리즈", "단편", "영화제", "감독", "배우", "제작", "흥행", "개봉", "스크린")),
    FASHION("패션", List.of("패션", "의류", "스타일", "브랜드", "트렌드", "디자이너", "신상", "컬렉션", "코디", "악세사리", "패션쇼", "모델", "구두", "신발", "청바지", "가방", "아우터", "슈즈", "캐주얼", "정장")),
    HEALTH("건강", List.of("운동", "피트니스", "다이어트", "헬스", "영양", "보충제", "비타민", "정신건강", "피부관리", "헬스케어", "요가", "필라테스", "건강식품", "체중관리", "수면", "스트레스", "체력", "마음챙김", "웰빙", "질병")),
    EDUCATION("교육", List.of("교육", "대학", "학교", "입시", "수능", "공부", "학원", "과외", "교재", "온라인강의", "연구", "학습", "유학", "장학금", "진로", "초등학교", "중학교", "고등학교", "대학원", "특강")),
    BOOKS("도서", List.of("책", "베스트셀러", "소설", "자기계발", "에세이", "역사", "철학", "문학", "경제서적", "심리학", "과학서적", "인문학", "아동도서", "전기", "판타지", "추리소설", "단편집", "작가", "문학상", "서점"));


    private final String groupName;
    private final List<String> keywords;

    KeywordGroup(String groupName, List<String> keywords) {
        this.groupName = groupName;
        this.keywords = keywords;
    }

    public String getGroupName() {
        return groupName;
    }

    public List<String> getKeywords() {
        return keywords;
    }
}
